{
  "date": "2024-05-17",
  "salaryRange": "0-11000",
  "id": "75960447",
  "job-list-view-job-link": "",
  "job-list-item-link-overlay": "",
  "company-logo-container": "",
  "company-logo": "",
  "jobTitle": "Project Manager / Assistant Project Manager / Senior Project Executive",
  "jobCompany": "Hypthon Limited",
  "signed-out-save-job": "",
  "jobLocation": "Sham Shui Po District",
  "jobSubClassification": "Programme & Project Management",
  "jobClassification": "(Information & Communication Technology)",
  "jobListingDate": "1h ago",
  "jobAdDetails": "Roles & Responsibility:\nWe are seeking a passionate Project Manager / Assistant / Senior Project Executive who can lead a small project team to manage multi website. The role involves taking responsibility for project planning, requirement analysis, prepare project document, UAT support and coordinating with clients and vendors. The detailed responsibilities are as follows:\n \n\nDemonstrate strong project management skills to ensure the best throughout the project. \nMaintain and update the content for a large-scale website in a timely and professional manner. \nCollaborating with stakeholders to elicit, analyze, and document business requirements, ensuring a clear understanding of objectives and needs. \nEngaging and communicating with stakeholders at different levels to gather input, resolve conflicts, and ensure alignment between business objectives and project outcomes. \nConduct regular status meetings with stakeholders to provide project updates, gather feedback, and address any concerns. \nCreating comprehensive documentation, including functional specifications, business requirements documents, use cases, process flow diagrams, and user stories, to ensure clarity and facilitate project implementation. \nActively engage in project risk management and problem-solving, providing appropriate solutions and improvement recommendations. \nEffectively communicate and negotiate with clients, understanding their needs and expectations, and ensuring project completion to their satisfaction. \nPossess strong organizational and time management skills to handle multiple projects and priorities efficiently.\n\nYou can teach us something new! We love to hire people who are way more knowledgeable than us in some area and can be good teachers and mentors.\n\nRequirements:\n \n\nDemonstrated expertise as a Web Master in managing websites, with a strong history of successful project deliveries.\nStrong knowledge of Adobe products, such as Adobe Experience Manager, Adobe Target, and Adobe Launch, to effectively collaborate with stakeholders on content updates with personalization features. \nUnderstanding of website development technologies, including HTML, CSS, JavaScript, etc. \nExcellent organizational, time management, and problem-solving skills, with the ability to prioritize tasks and manage multiple projects simultaneously. \nStrong communication and interpersonal skills, with the ability to effectively communicate project goals, progress, and requirements to both technical and non-technical stakeholders. \nProfessional attitude with the ability to work well in a team or independently, along with openness to learning new skills. \nProactive and detail-oriented, with a focus on delivering high-quality results. Proficiency in both English and Chinese, with fluency in Putonghua being advantageous. \nBachelor's degree in a relevant field or equivalent work experience.\n\nDesire:\n \n\nPrevious experience in website management is preferred.\nPassion for exploring new technologies and continuously learning about emerging trends in the market."
}