[
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75960447",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Project Manager / Assistant Project Manager / Senior Project Executive",
    "jobCompany": "Hypthon Limited",
    "signed-out-save-job": "",
    "jobLocation": "Sham Shui Po District",
    "jobSubClassification": "Programme & Project Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "1h ago",
    "jobAdDetails": "Roles & Responsibility:\nWe are seeking a passionate Project Manager / Assistant / Senior Project Executive who can lead a small project team to manage multi website. The role involves taking responsibility for project planning, requirement analysis, prepare project document, UAT support and coordinating with clients and vendors. The detailed responsibilities are as follows:\n \n\nDemonstrate strong project management skills to ensure the best throughout the project. \nMaintain and update the content for a large-scale website in a timely and professional manner. \nCollaborating with stakeholders to elicit, analyze, and document business requirements, ensuring a clear understanding of objectives and needs. \nEngaging and communicating with stakeholders at different levels to gather input, resolve conflicts, and ensure alignment between business objectives and project outcomes. \nConduct regular status meetings with stakeholders to provide project updates, gather feedback, and address any concerns. \nCreating comprehensive documentation, including functional specifications, business requirements documents, use cases, process flow diagrams, and user stories, to ensure clarity and facilitate project implementation. \nActively engage in project risk management and problem-solving, providing appropriate solutions and improvement recommendations. \nEffectively communicate and negotiate with clients, understanding their needs and expectations, and ensuring project completion to their satisfaction. \nPossess strong organizational and time management skills to handle multiple projects and priorities efficiently.\n\nYou can teach us something new! We love to hire people who are way more knowledgeable than us in some area and can be good teachers and mentors.\n\nRequirements:\n \n\nDemonstrated expertise as a Web Master in managing websites, with a strong history of successful project deliveries.\nStrong knowledge of Adobe products, such as Adobe Experience Manager, Adobe Target, and Adobe Launch, to effectively collaborate with stakeholders on content updates with personalization features. \nUnderstanding of website development technologies, including HTML, CSS, JavaScript, etc. \nExcellent organizational, time management, and problem-solving skills, with the ability to prioritize tasks and manage multiple projects simultaneously. \nStrong communication and interpersonal skills, with the ability to effectively communicate project goals, progress, and requirements to both technical and non-technical stakeholders. \nProfessional attitude with the ability to work well in a team or independently, along with openness to learning new skills. \nProactive and detail-oriented, with a focus on delivering high-quality results. Proficiency in both English and Chinese, with fluency in Putonghua being advantageous. \nBachelor's degree in a relevant field or equivalent work experience.\n\nDesire:\n \n\nPrevious experience in website management is preferred.\nPassion for exploring new technologies and continuously learning about emerging trends in the market."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75948317",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Information Technology Officer",
    "jobCompany": "Hong Kong Baptist University",
    "signed-out-save-job": "",
    "jobLocation": "Kowloon City District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "6h ago",
    "jobAdDetails": "OFFICE OF INFORMATION TECHNOLOGY\n\nInformation Technology Officer (Customer Services/User Support) (Role: ITSM) (23240624)\n\nReporting to the Senior Information Technology Manager (Customer Services/User Support) of the Office of Information Technology, the appointee will provide the first line of support to the University community in the use of IT services for the purpose of teaching and learning as well as a business operation. \n\nResponsibilities:\n\nAssist in the implementation of ITSM project and maintain daily operations on ServiceNow platform;\nProvide support to CAB meetings to facilitate the approval process from management and business user review;\nCreate training materials, user guides, and knowledge articles to support IT staff and end-users in understanding and utilising ITSM processes and tools effectively;\nCollaborate with IT teams to resolve major incidents and problems, ensuring minimal impact on business operations;\nWork closely with the IT teams to ensure that IT services are aligned with business objectives and meet service level agreements (SLAs);\nHelp monitor and report on the performance of IT services, identifying areas for improvement and implementing service enhancement initiatives;\nWork with vendor to perform IT support activities; and\nPerform ad hoc assignments and responsibilities requested by supervisor.\n\nRequirements:\n\nA bachelor’s degree in information technology, computer science or related discipline;\nAt least 3 years or above of relevant work experience;\nExperience in the administration of ServiceNow and knowledge of ITIL processes and best practices are preferred;\nExcellent problem-solving skills with a technology-driven and analytical mindset;\nGood written and verbal communication skills with the ability to work under pressure; and\nIndependent, self-motivated, quick learner, good team player, a strong sense of responsibility and able to work under pressure.\n\nShortlisted candidates will be invited to sit for a written test.\n\nThe initial appointment will be made on a fixed-term contract of two years. Re-appointment thereafter is subject to performance review and mutual agreement.\n\nSalary will be commensurate with qualifications and experience.\n\nApplication Procedure:\n\nApplicants are invited to submit their applications at the HKBU e-Recruitment System.  Those who are not invited for interview 8 weeks after submission of the application may consider their applications unsuccessful.  Details of the University’s Personal Information Collection Statement can be found at https://hro.hkbu.edu.hk/en/worklife-at-hkbu/employee-favourable-environment.html#privacy-policy.\n\nThe University reserves the right not to make an appointment for the post advertised, and the appointment will be made according to the terms and conditions applicable at the time of offer.\n\nReview of applications is ongoing until the position is filled."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75947016",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "IT Officer in the Enterprise Solutions Office [Ref. D/388/03]",
    "jobCompany": "City University of Hong Kong",
    "signed-out-save-job": "",
    "jobLocation": "Kowloon City District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "7h ago",
    "jobAdDetails": "As part of the Central IT at City University of Hong Kong, the Enterprise Solutions Office (ESU) manages the University’s central information systems, system integrations and technology platforms to provide better and more efficient services to students, staff, alumni and the administration of the University.\n\nDuties\n\nReporting to the IT Manager, the appointee will be an in-house expert in application and integration development for IT/digital solutions and platforms (“Systems”) to support the large-scale Digital Transformation and daily operation of the University.  Major duties include to:\n\nBe responsible for the software development and maintenance of student information system and other administrative areas;\nAnalyse user requirements, design and develop IT solutions for business needs;\nEnsure the responsible Systems are adequately supported through prompt resolution of system problems, maintenance of system documentation and training material;\nContribute to efficient business processes by working with business/IT process owners to identify and implement new and improved system functionality;\nDevelop and maintain effective partnerships and teamwork through close collaboration with internal stakeholders, IT teams and external vendors;\nAssist the supervisor in feasibility study, solution planning, proof-of-concept on new technology or solution; and\nSupport any other IT projects and assignments as directed.\n\nRequirements\n\nA Bachelor’s degree in Computer Science/Information Technology or related disciplines;\nSolid knowledge of and/or experience in ANY of the following:\nDevelopment with SQL, PL/SQL, Java, HTML, CSS, JavaScript, AJAX, Python, jQuery and Bootstrap\nOracle Database\nProficiency in both written and spoken English and Chinese; and\nBeing a fast learner with a can-do attitude, self-motivation, and the ability to work independently are required.\nWorking knowledge of Ellucian Banner and Exadata; and\nKnowledge of and experience in ANY of the following would be an advantage:\nSharePoint Administration;\nRPA (e.g. UiPath, Automation Anywhere, Blue Prism, etc.);\nLow code development platforms (e.g. DragOnce, Power Platforms, Outsystems, Dell Boomi Flow, etc.);\nData Management & Analytics (e.g. Azure Synapse, Power BI, Qlik, Alteryx, Tableau, etc.);\nAPI management (e.g. Mulesoft, Dell Boomi, etc.);\nAgile development, DevOps, Docker and Kubernetes.\n\nFresh graduates will also be considered.\n\nShortlisted candidates may be invited for a written test.\n\n(Those who have responded to the previous advertisements need not re-apply.)\n\nSalary and Conditions of Service\n\nRemuneration package will be highly competitive, commensurate with qualifications and experience. Appointment will be made on a fixed-term contract; fringe benefits include gratuity, leave, medical and dental schemes.\n\nInformation and Application\n\nFurther information on the post and the University is available at http://www.cityu.edu.hk, or from the Human Resources Office, City University of Hong Kong, Tat Chee Avenue, Kowloon Tong, Hong Kong [Email : hrojob@cityu.edu.hk/Fax : 2788 1154 or 3442 0311]. \n\nTo apply, please submit an online application at http://jobs.cityu.edu.hk. The closing date is 31 May 2024. Applications will receive full consideration and only shortlisted applicants will be contacted. The University’s privacy policy is available on the homepage.\n\nCity University of Hong Kong is an equal opportunity employer. We are committed to the principle of diversity. Personal data provided by applicants will be used for recruitment and other employment-related purposes.\n\nWorldwide recognition ranking #70 (QS 2024), and #4 among top 50 universities under age 50 (QS 2021); #1 in the World’s Most International Universities (THE 2024); #1 in Automation & Control/Electrical & Electronic Engineering/Materials Science & Engineering/Metallurgical Engineering/Nanoscience & Nanotechnology and #2 in Telecommunication Engineering in Hong Kong (GRAS 2023); and #39 Business School in the World and #5 in Asia (UT Dallas 2019 to 2023)"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75962762",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Assistant Accountant (Group Financial Reporting)",
    "jobCompany": "The Hong Kong And China Gas Co Ltd",
    "signed-out-save-job": "",
    "jobLocation": "Eastern District",
    "jobSubClassification": "Business/Systems Analysts",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "26m ago",
    "jobAdDetails": "The Role:\n\nAssist in the coordination of Group Budget preparations and conduct variance analysis\nPrepare monthly management report on operating performance\nAssist in month end accounts closing and prepare audit schedules\nSupport presentations for management meetings\nPrepare tax computations and annual statutory accounts\nPerform bank reconciliations\nAssist in ad-hoc projects review as assigned by management\n\n \n\nThe Person:\n\nDegree in Accounting or related disciplines \n1-3 years’ experience in financial / management accounting or auditing, fresh graduated will also be considered\nFamiliar with SAP or similar financial accounting package is an advantage\nProficient in MS office applications especially on Excel, Word and PowerPoint\nStrong analytical mind and be able to work independently \nGood interpersonal and communication skills\nGood command of written and spoken English and Chinese; Fluent in Mandarin is a plus\n\n \n\nApplication with full details stating current and expected salary to: APPLY NOW \n\nPlease quote the reference number (GFRD/AA/JDB02/24) in your application.\n\n(All personal data provided will be treated in strict confidence and used for recruitment purposes only.)"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75958432",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "System Administrator",
    "jobCompany": "Meadville Technologies Company Limited",
    "signed-out-save-job": "",
    "jobLocation": "Sha Tin District",
    "jobSubClassification": "Networks & Systems Administration",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "2h ago",
    "jobAdDetails": "Job Description:\n\n \n\nDesigning, configuring, and managing the company's SD-WAN network in the Hong Kong office, domestic factories, and other Asian branch offices, ensuring network performance and availability.\nManaging the company's ERP system, ensuring system stability and timely resolution of any faults or issues.\nDesigning, configuring, and managing the company's LED wall systems in various offices and factories, including hardware selection, installation configuration, content management, and providing technical support.\nImplementing access control, firewall settings, and vulnerability patching to ensure the security of the systems and networks.\nMonitoring system and network performance, making adjustments and optimizations to improve efficiency.\nDeveloping and implementing data backup and recovery strategies to ensure data security and integrity.\nProvide technical support and troubleshooting to resolve user issues with the use of systems and software.\n\n \n\nJob Requirements:\n\n \n\nExtensive experience in SD-WAN configuration and management, familiar with common SD-WAN solutions.\nFamiliar with the configuration and management of LED display walls, with experience in installation, maintenance, and troubleshooting.\nRelevant experience and skills in ERP system management, including operating system management and network management.\nFamiliar with VPN technology, including point-to-point VPN and remote access VPN, with experience in setting up, managing, and monitoring.\nFamiliar with firewall configuration and management, including hardware and software firewalls.\nPossess a degree in computer science, information technology, or a related field.\nRelevant work experience, with priority given to those with experience in domestic-related systems.\nGood Mandarin communication skills and teamwork abilities, with some understanding of Chinese culture."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75948969",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Assistant Officer, IT Application Development (Fresh Graduate Welcome)",
    "jobCompany": "Airstar Bank Limited",
    "signed-out-save-job": "",
    "jobLocation": "Yau Tsim Mong District",
    "jobSubClassification": "Developers/Programmers",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "6h ago",
    "jobAdDetails": "Job Responsibilities  \nPrepares project feasibility studies, and identifies appropriate systems solutions for user requirement\nAct as the key interface between business users and technical developers. \nManage IT project implementation and testing\n Review of user requirements and UAT \nCoordinate Vendor for the development work \nProvide production support and ensure timely recovery on system issues \nTo assist mobile apps and web-based system development  \nJob Requirements  \nDegree in IT or Computer Science or related discipline  \nKnowledge in skill of programming in Java, Spring, Websphere, Nginx,Redis, RabbitMQ, Docker, API ,HTML5, Unix Scripts, Oracle, MYSQL \nFamiliar with web application development, common development frameworks, Microservices \nGood communication skill in both Chinese and English \nAbility to work under pressure \nSelf-motivation with excellent interpersonal skills \nStrong problem solving and logical thinking skill"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75946062",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Officer, Information Technology",
    "jobCompany": "Hong Kong Air Cargo Carrier Limited",
    "signed-out-save-job": "",
    "jobLocation": "Islands District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "7h ago",
    "jobAdDetails": "Responsibilities\n\nCarry out daily and ad-hoc support tasks for the IT helpdesk;\nProvide technical support for online meetings to ensure the success of the meeting;\nResponsible for computer hardware/software procurement and troubleshooting;\nCoordinate with vendors for hardware and software support and maintenance;\nReviewing and updating technical documents.\n \n\nRequirements\n\nA Diploma or above in Computer studies / Information technology or related discipline;\nCertified MCSE/CCNA/ITIL is an advantage;\n2 years or above relevant experiences;\nGood interpersonal and communication skills; \nGood command in both written and spoken English and Cantonese (Mandarin is a plus);\nKnowledge of computer hardware, software, network, protocol, and virtualization technologies such as Vmware."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75944691",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "IT Officer",
    "jobCompany": "Xtep Retail Trading Limited",
    "signed-out-save-job": "",
    "jobLocation": "Kwun Tong District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "8h ago",
    "jobAdDetails": "Responsibilities:\n\nProvide technical support for office and retail stores\nManage operation applications including ERP, POS, SAP and other digital initiatives\nHandle IT infrastructure set up, maintenance, cost estimation and budgeting of retail stores\nMonitor Network POS backup, security and server performances\nManage and ensure the vendor performances \nRegular review and maintain proper records of IT inventories\nWork closely with Taiwan IT teams for project execution in Hong Kong\n\nRequirement:\n\nDiploma or above in Computer Science, Information Technology or relevant disciplines\n3 years relevant experience in retail, sport or FMCG, experienced in on-site support will be an added advantage\nExperience in O365, SAP, ERP and POS is highly preferable\nSelf-motivated, responsible and well-organized\nGood command of written and spoken in English and Chinese\nShort notice period is preferred"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75947529",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Summer Intern (IT)",
    "jobCompany": "SF Supply Chain (Hong Kong) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Kwai Tsing District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "7h ago",
    "jobAdDetails": "Responsibilities:\n\nAssist in IT projects (workflow status tracking and coordination)\nProvide administrative support to the IT department\nPerform projects and tasks as assigned \n\nRequirements:\n\nUniversity undergraduates (non-final year), preferably Computer Science & IT, Supply Chain Management or related disciplines\nProactive, energetic, willing to learn and self-motivated with strong sense of responsibility\nKnowledge in MS office (Word, Excel & PowerPoint) and Chinese Word Processing\nGood command of both written and spoken English and Chinese (including Mandarin)\nE-commerce related experience is preferable\nIT solution QC/testing experience is preferable\nRPA experience is preferable\n\nInternship Period: Jun – Aug 2024\n\nInterested parties please send your application with CV stating your date of availability by \"Apply Now\" or WhatsApp 6469 8454 for enquiries.\n\nAll personal data provided by job applicants are used for recruitment purpose only and will be treated strictly confidential."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "74650502",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "PROJECT ENGINEER",
    "jobCompany": "Henderson Land Development Company Limited",
    "signed-out-save-job": "",
    "jobLocation": "Central and Western District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "5h ago",
    "jobAdDetails": "Ref. No.: JDB/HLD20/PE\n\nResponsibilities\n\nManage and implement system installation, configuration, upgrade, patching, security & hardening\nImprove system tasks with script automation\nDevelop and maintain system documentation & procedure manuals\nManage capacity, performance and security monitoring\nTroubleshoot system operation, performance and security problems\nProvide technical and user support on different technology solutions\nPerform ad-hoc assignments as required\n\nRequirements\n\nDegree in Information Technology, Computer Science or related discipline\nMinimum 3 years’ relevant working experience in Windows, Linux, Virtualization system installation, upgrade, security and maintenance\nHands-on experience in Windows PowerShell, Linux shell scripting and automation tools\nProven experience in help desk and end-user support is an asset\nExperience in Microsoft Exchange, Active Directory or SQL is a plus\nA good team player with good interpersonal and communication skills\nGood command of English and Chinese, proficiency in English writing is a plus\nAble to work outside office hours for system upgrades, patching and other ad-hoc tasks\n\nAttractive salary and fringe benefits will be offered to the successful candidates. Please apply with full resume by mail to Human Resources Department, Henderson Land Development Co. Ltd., 71/F, Two International Finance Centre, 8 Finance Street, Central, Hong Kong or by fax at 2905 1855 or visit our homepage at http://www.hld.com [link removed] or by clicking \"Apply Now\".\n \n\n(Please quote the ref. no. on letter) \n\nPersonal data provided by job applicants will be used for recruitment purpose only."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75946405",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Programme Officer / Programme Coordinator",
    "jobCompany": "The University of Hong Kong",
    "signed-out-save-job": "",
    "jobLocation": "Southern District",
    "jobSubClassification": "Programme & Project Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "7h ago",
    "jobAdDetails": "Programme Officer (at the rank of Clerk I) / Programme Coordinator (at the rank of Clerk II) in the Admissions Office of the Registry (Ref.: 526772) (to commence as soon as possible, on a two-year fixed-term basis with contract-end gratuity and University contribution to a retirement benefits scheme, totalling up to 10% of basic salary, and with the possibility of renewal)\n\n \n\nApplicants should have a good Bachelor's degree with at least 2 years’ relevant experience preferably in tertiary institutions or public organisations, such as schools, NGOs, etc., a good command of both written and spoken English and Chinese (including Putonghua) and IT proficiency in common computer applications.  They should also have good organisational and communication skills, and the ability to work independently with initiative.  They should be good team players, outgoing, self-motivated with a strong sense of responsibility.  Applicants with less experience may be considered for appointment as Programme Coordinator.\n\n \n\nThe appointee will be responsible for working with schools, students, and the community to support the internationalisation of the University’s undergraduate population.  He/She will be supporting the development of student programmes in Mainland China.  He/She will also be responsible for the planning, marketing, implementation and administration of student programmes and events.  The appointee is also required to liaise with other departments of the University and external organisations, and perform any other duties as assigned by the Head of the Office. He/She may be required to work outside office hours and on weekends.\n\n \n\nShortlisted candidates will be invited to attend a written test and an interview.\n\n \n\nA highly competitive salary commensurate with qualifications and experience will be offered, in addition to annual leave and medical benefits.\n\n \n\nThe University only accepts online applications for the above post.  Applicants should apply online at the University’s career site (https://jobs.hku.hk), and upload an up-to-date C.V. Closes June 16, 2024.\n\n \n\nThe University is an equal opportunities employer and\n\nis committed to equality, ethics, inclusivity, diversity and transparency"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75943420",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Customer Service Coordinator (5-day work, Shatin)",
    "jobCompany": "Automated Systems (HK) Ltd",
    "signed-out-save-job": "",
    "jobLocation": "Sha Tin District",
    "jobSubClassification": "Sales - Pre & Post",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "9h ago",
    "jobAdDetails": "Responsibilities:\n\nMaintain and manage the Sales Order functions, including maintaining the SO, following up projects, shipment, and delivery, and issuing of invoices \nHandle delivery process to achieve on-time delivery targets\nCoordinate with internal and external parties to ensure smooth and efficient delivery of products or services\nHandle customer inquiries regarding project status, shipment schedule, and invoices\n\n \n\nRequirements:\n\nF.5 / HKDSE or above\n1 year of experience in customer service or administration (Candidates with no experience will also be considered)\nKnowledge of SAP application is an advantage\nGood customer service and communication skills\nProficiency in Microsoft Office applications\nDemonstrate a cheerful and positive attitude, as well as being responsible, polite and helpful\nImmediate available is preferred\n\n \n\nWe offer 5-day week, excellent career opportunities, remuneration and benefits to the right candidates. Please apply with your full resume with present and expected salary to Human Resources Department by clicking \"Apply Now\".\n\n \n\nTo learn us more, please visit our website: www.asl.com.hk\n\nWe are an equal opportunity employer. All applications will be treated in strict confidence. We regret that only shortlisted candidates will be notified. All personal data will be destroyed within six months after the selection process."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75951199",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Assistant Operations Manager (Data Centre)",
    "jobCompany": "OneAsia Network Limited",
    "signed-out-save-job": "",
    "jobLocation": "Kwun Tong District",
    "jobSubClassification": "Networks & Systems Administration",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "5h ago",
    "jobAdDetails": "Responsibilities:\n\nCreate and maintain weekly, monthly and yearly productivity reports.\nPlans & schedules training for new staff. Ensures the training is conducted and completed as per the plan.\nFacilitate training and refreshers to develop team’s skills.\nConduct periodic review of related policies and procedures and record keeping.\nStandardize procedure model and document practical operation manual & guideline.\nManages daily operations to meet department and company objectives.\nRegular review and enhance the delivering standardized services including physical access, remote hands and cabling.\nTake ownership of major incidents, manage communication, and coordinate with cross-functional teams to restore services within agreed-upon service level agreements (SLAs)\nWork with software team to deliver system initiatives, engage in development cycles, for internal tools and systems.\nPlan, prioritize, implement, and evaluate the operation improvement initiatives.\nRequirements:\n\nDegree / Diploma holder in IT / Operations or related discipline.\nMinimum 3 years as a supervisor or higher-level management position.\nKnowledge and experience in IT/ICT and Data Centre will be an advantage.\nOpen to change and continuous improvement.\nInitiative, independent, self-driven, responsible and result oriented.\nGood supervisory, communication & interpersonal skills.\nFluent written and spoken Chinese and English.\nYou have a career opportunity in gaining knowledge and experience in serving one of the largest Data Centre providers for local and international enterprise.\n\nAttractive remuneration package and fringe benefits, including 5-day work, performance bonus, medical insurance with dental benefit, paid annual leave, sick leave, marriage leave etc., will be offered to the right candidate.\n\nInterested parties, please send your full resume stating with current and expected salary to the Human Resources & Administration Department by clicking Apply Now.\n\nFor more information, please visit our website at http://www.oneas1a.com [link removed]\n\nEqual employment opportunities apply to all applicants. All applications and data collected will be treated in strict confidence and used exclusively for recruitment purposes. Only short-listed candidates will be invited for interview. The company will retain the applications for a maximum period of 12 months and may refer suitable candidates to other vacancies within the Group."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75947186",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "(Senior) System Analyst | FMCG Retail | Commercial Apps - CRM POS",
    "jobCompany": "Vita Green Health Products Company Limited",
    "signed-out-save-job": "",
    "jobLocation": "Yau Tsim Mong District",
    "jobSubClassification": "Engineering - Software",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "7h ago",
    "jobAdDetails": "We are looking for an application (Senior) System Analyst or Team Lead for our IT department for the retail, data and commercial applications.\n\nThe talent will lead the team of commercial and data applications, and must be a hands-on technical individual. He/she will focus on commercial applications including POS, CRM, DWH / BI and Marketing Automation projects, and the integration between retail applications, e-Commerce and ERP.\n\n \n\nIf you are...\n\nAt least 4 years hands on software development experience\nSubject Matter Expert in retail domain, with strong experience in POS and CRM applications\nWork with business stakeholders and internal BA for requirements gathering and analysis\nResponsible for retail application system design and solutioning\nHands-on experience in any of C# .NET / Java / JavaScript application development, understanding of API and Web Services development\nExperience with Business Intelligence / SSRS projects will be a plus\nExperience in managing onshore and offshore technical teams\nWork with tier 1 support team for supporting retail applications\nGood command of languages, Cantonese and English\n\nYou will enjoy...\n\nFlexible work arrangement and casual wear work environment\nEnjoy different special leaves - birthday leave, anniversary leave, examination leave & travel leaves\nFun working culture with challenges to learn and grow together\nRapid growth opportunities for strong performers\nChance to work on cutting-edge transformation or migration projects\n\n \n\n#LI-AMBER"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75944119",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Assistant Computer Officer",
    "jobCompany": "The Chinese University of Hong Kong",
    "signed-out-save-job": "",
    "jobLocation": "Sha Tin District",
    "jobSubClassification": "Programme & Project Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "8h ago",
    "jobAdDetails": "Information Technology Services Centre\nAssistant Computer Officer (Ref. 240001AX) (Closing date: May 28, 2024)\nThe appointee will work primarily as a programmer/analyst in the development and maintenance of the University’s key administrative systems. He/She will be responsible for (a) assisting in design, development, and maintenance of the University-wide in-house developed systems and the ERP administrative systems; (b) assisting in conducting system testing, debugging, and troubleshooting to identify and resolve issues; (c) providing technical support, assistance and training to end-users; and (d) building data analytics to support top management’s decision-making process.\nApplicants should have (i) a Bachelor’s degree in Computer Science, Information Technology, or a related discipline; (ii) good analytical and problem-solving skills; (iii) a quality conscious mindset; (iv) track record as a good team player; (v) self-motivation; and (vi) a good command of both spoken and written English and Chinese. Knowledge and work experience in PeopleSoft Campus Solution, PeopleSoft HCM, Oracle Database, MS SQL Server, ASP.Net will be an added advantage. \nAppointment will initially be made on a 2-year contract with contract-end gratuity, renewable subject to good performance and mutual agreement.\n[Those who have responded to the previous advertisement for the same post (Ref. 240000L2 and 240000WK) need not re-apply.]"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "74485802",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Application Support Specialist",
    "jobCompany": "Shiji Information Technology (Hong Kong) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Kwun Tong District",
    "jobSubClassification": "Engineering - Software",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "3h ago",
    "jobAdDetails": "Company Overview\n\nFounded in 1998, Shiji’s aim is to become a “big data” application service platform operator. Shiji has become the leading manufacturer of Chinese hotel information systems after three successful transformations. At the same time, Shiji is gradually expanding from hotel to catering and retail industries, becoming the major software supplier to both industries. Now, Shiji is responsible for approximately 60% to 70% of the market share in the high end sector of hotel and retail industries, and possesses a leading position in the catering industry. The estimated annual revenue of Shiji clients can be more than RMB 5 trillion. Shiji has completed three successful transformations since its establishment. It is now experiencing the 4th transformation dedicating to be a “big data” driven consumer application service platform operator. Shiji has introduced consulting, IT solutions and data platform services. Meanwhile, Shiji is developing worldwide leading products and technologies aiming for the international market and speeding up its globalization progress. Currently Shiji has more than 50 subsidiaries located in major Chinese cities and overseas markets (Singapore and Munich) with over 3,000 employees.\n\nFor further information about us, please visit http://www.shijigroup.com/.\n\nResponsibilities:\n\nProviding services to provide second-tier technical support including troubleshooting, problem identification, resolution, and escalation\nPerform Data fixes and Configuration fixes\nWork together with Developers who are the third-tier application support to resolve the reported issues by gathering necessary information and problem simulation\nPrepare and maintain document of the support service details and troubleshooting steps\nProvide solution on performance, service monitoring and proactive system tuning\nProvide stand-by and ad-hoc support at non-office hours\n\nRequirements:\n\nHigher Diploma holder or above in Information Technology, Computer Studies, or related discipline in the IT field\nAt least 3 years' experience in IT system support and administration with relevant working experience in F&B POS system support will be an advantage\nGood technical skill on Windows and mobile applications\nSound experience in Apache and MYSQL sever\nKnowledge of application programming, web programming will be definitely an advantage\nKnowledge on CI/CD is a plus\nGood command in both spoken and written English and Chinese\nWilling to learn, strong responsibility, good interpersonal & communication skills\nSelf-motivated, able to work independently under minimal supervision\nStrong troubleshooting and risk analysis skills with time management capability\n\nInterested candidates please send your full CV with date of availability and expected salary in Microsoft Word / PDF.\n\nPersonal information collected will be used for recruitment purpose only and will be kept strictly confidential for six months."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75944142",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Assistant Computer Officer",
    "jobCompany": "The Chinese University of Hong Kong",
    "signed-out-save-job": "",
    "jobLocation": "Sha Tin District",
    "jobSubClassification": "Programme & Project Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "8h ago",
    "jobAdDetails": "Information Technology Services Centre\nAssistant Computer Officer (Ref. 240001AY) (Closing date: May 28, 2024)\nThe appointee will work primarily as a programmer/analyst in the development and maintenance of the University’s key administrative systems. He/ She will be responsible for (a) assisting in design, development, and maintenance of the University-wide in-house developed systems and the ERP administrative systems; (b) assisting in conducting system testing, debugging, and troubleshooting to identify and resolve issues under guidance; (c) providing technical support, assistance and training to end-users; and (d) building data analytics to support top management’s decision-making process.\nApplicants should have (i) a Bachelor’s degree in Computer Science, Information Technology, or a related discipline; (ii) good analytical and problem-solving skills; (iii) a quality conscious mindset; (iv) track record as a good team player; (v) self-motivation; and (vi) a good command of both spoken and written English and Chinese. Fresh graduates are welcome to apply. \nAppointment will initially be made on a 2-year contract with contract-end gratuity, renewable subject to good performance and mutual agreement.\n[Those who have responded to the previous advertisements for the same post (Ref. 230003LB, 2400007U, 240000KU and 240000WJ) need not re-apply.]"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75961777",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Digital Products Manager, Information Technology",
    "jobCompany": "Maxim's Caterers Limited",
    "signed-out-save-job": "",
    "jobLocation": "Sham Shui Po District",
    "jobSubClassification": "Programme & Project Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "54m ago",
    "jobAdDetails": "Job Responsibilities:\n\nManage IT assets and resources to ensure that they are running efficiently.\nMonitor operational performance and respond to IT incidents\nDevelops service management strategies, identifying staff, tools and specialized support requirements as necessary to ensure that operational and support processes are working as expected.\nImplement DevSecOps practices for in-house and vendor development projects\nPlan and implement IT Service Management processes, software, and tools to optimize IT service delivery and reduce costs.\nConduct IT service quality assurance, monitor and analyze performance issues, and support IT governance and audit requirements.\nCoordinate the deployment of IT systems, including infrastructure, applications and other application owners.\nReview and confirm deployment process and vendor solutions for new projects.\n\n \n\nJob Requirements:\n\nUniversity or above in Information Technology, Computer Science, E-commerce or related disciplines\nAt least 10 years of working experience in IT industry, in digital/ eCommerce system, and application projects\nStrong communication, negotiation, interpersonal skills, analytical and problem-solving skills\nStrong understanding of the Information Technology Infrastructure Library (ITIL) framework and the ability to provide a strategic interface with assigned areas of IT Strategy Development, Design, Transition, Operation, and Continual Service Improvement.\nPreferably software engineering knowledge in the technology stack such NodeJS, React Native, ASP.NET, PHP, MSSQL / MYSQL / MongoDB\nStrong knowledge in Cloud computing in AWS / Microsoft Azure, with but not limited to Microservices / Dockers / Kubernetes / WAF / NAT / IaC(Terraform) in large scale infrastructure and the latest cloud technology.\nKnowledge in DevSecOps such as CI/CD pineline, SCA, SAST, DAST\nExperiences and understandings in Cyber Security principles, Information security risk managements & controls, OWASP TOP 10, and PCIDSS\nExperience in training and managing IT staff.\nStrong command in spoken and written English is a must\nExperience in F&B / Retail industry will be a plus\n\n \n\nInterested parties please apply with full resume, state current and expected salaries by clicking \"Apply Now\".\n\n \n\nAll applications and data collected will be treated in strict confidence and used exclusively for recruitment purposes. Only shortlisted candidates will be invited for interview. The company will retain the applications for a maximum period of 24 months and may refer suitable candidates to other vacancies within the Group."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75948412",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Manager - IT Customers Solution",
    "jobCompany": "SF Supply Chain (Hong Kong) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Kwai Tsing District",
    "jobSubClassification": "Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "6h ago",
    "jobAdDetails": "Main Responsibilities:\n\nHandle IT requirements from BD, key accounts, operations or customers and prepare related RFI Q&A, RFP, RFQ IT cost estimation for business opportunity \nWork with IT project manager to have clear & smooth transition on IT requirements from project awards to implementation\nTo meet with customers to support business team on IT matters \nMonitor opportunities pipeline and control the IT equipment buffering based on project's priority\nProvide proactive support or suggestion to optimize related IT internal process\nCapture market updates from research to enhance the IT solutions\n\n \n\nRequirements:\n\nBachelor’s degree or above in IT / Business / Engineering or Supply Chain Management related discipline(s) is preferred but not a must\nMinimum 5 years’ experience in handling IT solutions preferably from logistics related industries \nFamiliarize with RFI / RFP / RFQ process \nWith IT pre-sales experience will be an advantage\nAble to work under pressure and respond aggressively to the business in order to increase the chance of winning business opportunities\nWell organized, customer oriented, fast learner, presentable & confident with strong people’s communication in both written and spoken English and Chinese\nGood tasks management skill with conversance in MS excel\nImmediate available will be an advantage"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "74485959",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Application Support Engineer",
    "jobCompany": "Shiji Information Technology (Hong Kong) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Kwun Tong District",
    "jobSubClassification": "Engineering - Software",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "3h ago",
    "jobAdDetails": "Company Overview\n\nFounded in 1998, Shiji’s aim is to become a “big data” application service platform operator. Shiji has become the leading manufacturer of Chinese hotel information systems after three successful transformations. At the same time, Shiji is gradually expanding from hotel to catering and retail industries, becoming the major software supplier to both industries. Now, Shiji is responsible for approximately 60% to 70% of the market share in the high end sector of hotel and retail industries, and possesses a leading position in the catering industry. The estimated annual revenue of Shiji clients can be more than RMB 5 trillion. Shiji has completed three successful transformations since its establishment. It is now experiencing the 4th transformation dedicating to be a “big data” driven consumer application service platform operator. Shiji has introduced consulting, IT solutions and data platform services. Meanwhile, Shiji is developing worldwide leading products and technologies aiming for the international market and speeding up its globalization progress. Currently Shiji has more than 50 subsidiaries located in major Chinese cities and overseas markets (Singapore and Munich) with over 3,000 employees.\n\nFor further information about us, please visit http://www.shijigroup.com/.\n\nResponsibilities:\n\nProviding services to provide second-tier technical support including troubleshooting, problem identification, resolution, and escalation\nPerform Data fixes and Configuration fixes\nWork together with Developers who are the third-tier application support to resolve the reported issues by gathering necessary information and problem simulation\nPrepare and maintain document of the support service details and troubleshooting steps\nProvide solution on performance, service monitoring and proactive system tuning\nProvide stand-by and ad-hoc support at non-office hours\n\nRequirements:\n\nHigher Diploma holder or above in Information Technology, Computer Studies, or related discipline in the IT field\nAt least 1 years' experience in IT system support and administration with relevant working experience in F&B POS system support will be an advantage\nGood technical skill on Windows and mobile applications\nSound experience in Apache and MYSQL sever\nKnowledge of application programming, web programming will be definitely an advantage\nGood command in both spoken and written English and Chinese\nWilling to learn, strong responsibility, good interpersonal & communication skills\nSelf-motivated, able to work independently under minimal supervision\nStrong troubleshooting and risk analysis skills with time management capability\n\nInterested candidates please send your full CV with date of availability and expected salary in Microsoft Word / PDF.\n\nPersonal information collected will be used for recruitment purpose only and will be kept strictly confidential for six months."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75954528",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "IT Support at Pricom Technology & System Limited",
    "jobCompany": "Jobsdb - SmartHire",
    "signed-out-save-job": "",
    "jobLocation": "Sham Shui Po District",
    "jobSubClassification": "Engineering - Hardware",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "3h ago",
    "jobAdDetails": "Our client \"Pricom Technology & System Limited\" is seeking an IT Support to join their team in Hong Kong!\n\n \n\n \n\nWhat you’ll be doing?\n\n \n\nPerform IT helpdesk frontline support (On-site, Phone, E-Mail, etc.)\nThe primary responsibility is to support needs via telephone and email and give initial support to users\nTechnical Support for Desktop PCs – both Software and Hardware\nTo perform support according to defined workflow and methods\nCo-ordinate with external vendors on application software inquiries and maintenance\nPrepare routine reports and documents of the supported IT \nService\n \n\n \n\n \n\nWho are they looking for?\n\n \n\nIT support or relevant experience (Less experience and Fresh Graduate will be considered)\nGood communication skills and telephone manner\nBe a good team player with minimum supervision\nImmediate available is preferred\n \n\n \n\n \n\nReady to join this role? Apply now to submit your resume with date of availability and expected salary to us! \n \n \n\nAll information received will be kept in strict confidence and will be treated only for employment-related purposes. \n\n \n\n \n\nRefer A Candidate and Earn $2,000 (Click this link to share referral details via email)\n\nThe Jobsdb SmartReward Program is applicable to this job opening. Applicants who successfully secure this job or refer a successful candidate, will receive the SmartReward as advertised. *By applying to or referring a candidate to this job, you agree to the Jobsdb SmartReward Program - Terms & Conditions\n\n#SmartReward #SmartHire"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75944892",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "BUSINESS EXECUTIVE",
    "jobCompany": "Wharf Real Estate Investment Company Limited",
    "signed-out-save-job": "",
    "jobLocation": "Yau Tsim Mong District",
    "jobSubClassification": "Business/Systems Analysts",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "8h ago",
    "jobAdDetails": "The Company is committed to building and developing quality human capital, not only for operational excellence that leads to organizational growth but also for career growth for aspiring talents.  In support of our quest for operational excellence and value creation, we aim at developing mid-career talents to be our future leaders at different levels to meet the business growth and embrace the challenges ahead.\n\n \n\nDepending on the career aspiration, exposure and qualification, the successful candidates will undergo placements in the investment properties in HK and Mainland covering retail and office leasing/ marketing/ centre operations/ tenant services.  For having a more holistic perspective of the Company’s business, rotation opportunities would form part of the career development and the incumbents will be nurtured for taking up management positions upon completion of the programme.\n \n\nBachelor degree holder or above in related disciplines\n3-5 years’ working experience in retail & office leasing/ omni-channel marketing strategy and campaigns gained in sizable/ reputable organizations\nExperience in supporting senior management in preparation of business proposals/ reports an added advantage\nStrong interest in developing career in property / asset management industry\nResourceful, positive thinking, self-motivated, versatile, innovative, highly analytical, organized and a good team player with strong interpersonal and communication skills\nDemonstrated strong leadership skills with sound business acumen\nHigh proficiency in both spoken and written English, Chinese and Putonghua\n\n \n\nAttractive financial packages will be offered to successful applicants, commensurate with professional status and past experience. Fringe benefits include 15 days' annual leave, employer’s top-up MPF contribution, family medical plan, training sponsorship, employee wellness programs and other benefits.\n\nIf you are ready to take the challenge, please send your application letter and full resume with date available, present and expected salary to the recruitment e-mail address.\n\n(Personal data provided will be used strictly in accordance with the Company’s personal data policy which is available upon request.)"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75946483",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "IT Specialist at Combi Holdings Limited",
    "jobCompany": "Jobsdb - SmartHire",
    "signed-out-save-job": "",
    "jobLocation": "Yau Tsim Mong District",
    "jobSubClassification": "Networks & Systems Administration",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "7h ago",
    "jobAdDetails": "Our client “Combi Holdings Limited” is seeking an IT Specialist to join their company! \n\n \n\nWhat you’ll be doing? \n\n \n\nDevelop and maintain the company’s information security systems to\nensure that safeguard computer files against accidental or unauthorized\nmodification, destruction, or disclosure and to meet emergency data\nprocessing needs\nIntroduce all necessary security measures to ensure that data systems are\nsecured from data loss or misuse\nResponsible for the development, review, and certification of all back-up\nand disaster recovery procedures and plans\nCoordinate and communicate with subsidiaries of IT Department to\nexecute and implement the IT control projects and related issues.\nEstablish and maintain all necessary information technology procedures\nand guidelines and ensure that all systems are supported by the\ndocumentation and manuals\nInteract with all levels of employee on internal and external operations\nthat are impacted by the capture, storage, processing and dissemination of information\nEvaluates the feasibility of modifications to, or replacement of hardware\n\n \n\n \n\nWho are they looking for? \n\n \n\nBachelor Degree or above in Information Technology or other relevant\ndisciplines.\n2 years related working experience especially factory plant in Mainland\nChina.\nGood knowledge and practical experience on managing MS SQL client\nServer Data Base Administration (e.g. MS SQL 2008/2012) and Oracle.\nKnowledge of Network, firewall, router and IP-VPN.\nGood understanding and practical experience in ERP system especially in\nFlex/Fion; UFIDA U9 (用友); Kingdee K/3 (金蝶).\nExperience of Transactional SQL, and DTS stored procedures.\nGood Cantonese and English. Mandarin is an advantage.\nResponsible, able to work under pressure and be a good team player.\n\n \n\n \n\nWhy you should consider this opportunity: \n\n \nOur client offers an attractive remuneration package with fringe benefits to the right candidate, such as \n\n \n\n5 days work week\n10 - 14 days Annual Leave\nMedical insurance\nDouble pay\nWork from home\nBank holidays\n\n \n\n \n\nWorking Hour: \n\n \n\n5 days work week, 8.5 hours per day (including 1 hour lunch time)\n\n \n\n \n\nReady to join this role? Apply now to submit your resume with date of availability and expected salary to us!  \n \n \n\nAll information received will be kept in strict confidence and will be treated only for employment-related purposes. \n\n \n\nRefer A Candidate and Earn $2,000 (Click this link to share referral details via email)\n\nThe Jobsdb SmartReward Program is applicable to this job opening. Applicants who successfully secure this job or refer a successful candidate, will receive the SmartReward as advertised. *By applying to or referring a candidate to this job, you agree to the Jobsdb SmartReward Program - Terms & Conditions\n\n#SmartReward #SmartHire"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75948420",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Information Technology Manager",
    "jobCompany": "Hong Kong Baptist University",
    "signed-out-save-job": "",
    "jobLocation": "Kowloon City District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "6h ago",
    "jobAdDetails": "OFFICE OF INFORMATION TECHNOLOGY\n\nInformation Technology Manager (Customer Services/User Support) (Role: ITSM) (23240623)\n\nReporting to the Senior Information Technology Manager (Customer Services/User Support) of Office of Information Technology, the appointee will provide the first line of support to the University community in the use of IT services for the purpose of teaching and learning as well as a business operation. \n\nResponsibilities:\n\nOversee IT Service Management function to implement ITSM project and daily operations on ServiceNow platform;\nLead CAB to package production change and facilitate the approval process from management and business user review;\nLead IT Asset Management to ensure IT asset inventory align to the asset life cycle;\nManage IT service release launches and change management, including documentation and training materials, and provide training to IT staff and users;\nAdopt automation to uplift the IT service operations efficiency and quality;\nLead the coordination and resolution of major incidents and problems, ensuring minimal impact on business operations;\nMonitor and report on the performance of IT services against established service level agreements (SLAs) and targets;\nWork with vendor to perform IT support activities; and\nPerform ad hoc assignments and responsibilities requested by supervisor.\n\nRequirements:\n\nA bachelor’s degree in information technology, computer science or related discipline;\nAt least 8 years or above of relevant work experience;\nProficiency in the administration of ServiceNow and knowledge of ITIL processes and best practices are essential;\nExcellent problem-solving skills with a technology-driven and analytical mindset;\nGood written and verbal communication skills with the ability to work under pressure; and\nIndependent, self-motivated, quick learner, good team player, a strong sense of responsibility and able to work under pressure.\n\nShortlisted candidates will be invited to sit for a written test.\n\nThe initial appointment will be made on a fixed-term contract of two years. Re-appointment thereafter is subject to performance review and mutual agreement.\n\nSalary will be commensurate with qualifications and experience.\n\nApplication Procedure:\n\nApplicants are invited to submit their applications at the HKBU e-Recruitment System.  Those who are not invited for interview 8 weeks after submission of the application may consider their applications unsuccessful.  Details of the University’s Personal Information Collection Statement can be found at https://hro.hkbu.edu.hk/en/worklife-at-hkbu/employee-favourable-environment.html#privacy-policy.\n\nThe University reserves the right not to make an appointment for the post advertised, and the appointment will be made according to the terms and conditions applicable at the time of offer.\n\nReview of applications is ongoing until the position is filled."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75945317",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "System Administrator",
    "jobCompany": "The Wing On Department Stores (Hong Kong) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Central and Western District",
    "jobSubClassification": "Networks & Systems Administration",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "8h ago",
    "jobAdDetails": "Responsibilities:\n\nHandle system installation, upgrade, configuration, administration, troubleshooting, patching, and monitoring of information systems including Microsoft AD, Exchange email, VM platform and endpoints system\nManage system storage and backup, and restore the operations\nAssist in planning and implementing systems and network integrations\nConfigure security settings or access permissions\nAnalyze and report computer system security breaches or attempted breaches\nLiaise and coordinate with vendors, suppliers, distributors, and contract consultants\nEvaluate new technologies and platforms to determine applicability to resolve business challenges\nMentor and guide junior staff on operation and configuration of systems \n\nRequirements:\n\nDegree or above in Computer Science, Information Technology or equivalent\nAt least 3 years’ experience of IT system administration in a Microsoft/Linux environment\nSolid experience in managing a Windows computer and server environment using tools such as Open-Source platform, Microsoft Active Directory, Group Policy Objects (GPOs), WSUS / SCCM, VEEAM\nSolid experience in managing the Cloud platform (Azure AD, AWS, Exchange, SSO integration etc.)\nProficient in using CLI, PowerShell or other scripting languages for managing Windows services, Microsoft 365 services and task automation\nGood knowledge of enterprise Ethernet, VLANs, QOS, routing, switching and IP addressing, experience in virtualization technologies (Esxi/KVM) is an advantage.\nHolder of vendor certificates (CCNA / Microsoft / etc.) is an advantage\nGood interpersonal and communication skills, self-motivated, and attention to details\nPassionate in learning new technologies and improve existing solutions\nGood command of both spoken and written English and Chinese, proficiency in Putonghua is an advantage\nImmediately available is highly preferred\n\nCommensurate remuneration and other fringe benefits will be offered to the right candidate.  Interested parties please send your full resume including expected salary to Human Resources Division, 3/F, Wing On Godown Building, 1 Wang Kee Street, Kowloon Bay, Kowloon, or by click \"APPLY NOW\" button below.\n\n(Candidates not invited for interview within one month may consider their applications filed for future reference.  All information collected will be used for recruitment purpose only and will be destroyed after 6 months.)"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75574623",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Data Engineer (Data and Analytics) (Ref: R5147)",
    "jobCompany": "West Kowloon Cultural District Authority",
    "signed-out-save-job": "",
    "jobLocation": "Yau Tsim Mong District",
    "jobSubClassification": "Engineering - Software",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "4m ago",
    "jobAdDetails": "You will be responsible for:\n\nmanaging the transformation of the Enterprise System Integration Platform for the Authority, you will be responsible for designing and maintaining data integration solutions to enhance the Authority's system integration capabilities;\nleading the enhancement project of the platform, working closely with cross-functional teams to understand requirements and develop data integration solutions;\ndesigning scalable and efficient data pipelines to integrate various systems, including internal databases, third-party APIs, and external data providers, ensuring smooth data flow and synchronisation;\nmanaging relationships with external vendors, including coordinating project activities, monitoring deliverables, and conducting regular status meetings to ensure successful execution;\ninvestigating and analysing data integration processes, identifying and resolving performance issues, data inconsistencies, and system failures;\nestablishing data governance practices and ensure data integrity, consistency, and reliability;\nmaintaining project documentation, including technical specifications, data mappings, and integration workflows to enhance the efficient use of data services; and\nstaying updated on emerging technologies related to data integration and cloud technologies, making recommendations for improvements and innovations.\n\n \n\nYou should:\n\npossess a recognised university degree or above in Computer Science, Data Engineer, Big Data Analytics, or equivalent;\nhave at least 5 years of experience managing Enterprise System Integration Platforms, including integration with on-premises and cloud-based systems.\nhave strong expertise in Azure cloud platform, including Azure Data Factory, Azure Logic Apps, and Azure Integration Services\nhave knowledge of data modelling, ETL processes, and data warehousing concepts.\nhave strong problem-solving skills, with the ability to address complex data integration challenges.\nhave experience with data security and privacy practices, including data encryption, access controls, and compliance with applicable regulations.\nhave experience in data governance and data quality management, such as data catalog, data operating models and standardised operating procedures.\nhave excellent communication and collaboration skills to effectively work with technical and non-technical stakeholders.\nfamiliarity with vendor management principles, including performance monitoring and issue resolution.\nbe proficient in written and spoken English and Chinese.\npossess relevant certifications such as Azure Data Engineer, Azure AI Engineer, AWS Cloud Data Engineer, or AWS Machine Learning Engineer are highly desirable; and\nbe proficient in written and spoken English and Chinese.\n\n \n\nFor interested parties, please submit your application with detailed CV on or before following date. Applicants are encouraged to submit their applications as soon as possible. The review of applications will continue until post is filled.\n\n \n\n31-05-2024\n\n \n\nData collected will only be used for job application processing. Your data may be accessed by our appointed recruitment consultants who have agreed to keep confidence of all personal data in not less than the standards applicable to us. Applicants not being invited for interview within 4 weeks from the submission date may assume their applications unsuccessful.\n\n \n\nAll related information will be kept up to 24 months and all personal data will be destroyed afterwards.\n\n \n\nFor more information, please visit https://www.westkowloon.hk or contact:\n\n \n\nSara Li /+852 22002518"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75386817",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "IT Assistant Manager/ Manager, Hong Kong",
    "jobCompany": "Select Service Partner Asia Pacific Limited",
    "signed-out-save-job": "",
    "jobLocation": "Yau Tsim Mong District",
    "jobSubClassification": "Help Desk & IT Support",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "5h ago",
    "jobAdDetails": "Role\n\nThe incumbent will be responsible for overseeing aspects of the company’s Information Technology including IT infrastructure, Enterprise solutions, business applications, Networking regulatory compliance, and new unit mobilization; by managing project team and/or IT vendors to deliver high quality IT services with respect to the agreed SLA (Service Level Agreement). \n\n \n\nResponsibilities\n\nIT Management\n\nManage a small team to position them for growth and development focusing on enhancing the overall team capability and promoting a positive culture.\nResponsible for the backup and security of all local IT Systems ensuring an effective disaster recovery plan is in place for all business systems.\n\nProject Management\n\nEvaluate the proposed IT projects and create solutions demonstrating technical architecture in line with HK operational requirements.\nManaging projects, resources, and colleagues to support and develop the company’s infrastructure, including hardware and software, servers and desktops, voice and data networks and cyber security solutions.\nMobilizations of new units and lounges\n\nService Level Agreement\n\nManage the ITSM tool to ensure customers are kept up to date and tickets resolved in a timely manner. \nTake responsibility of the local service levels aiming to highlight areas for improvement and promoting a positive culture for a job well done. \nDevelop team members through tutoring and skills transfer to ensure all internal stakeholders have a quick and easy resolution to all tickets. \n\nOperation Management\n\nProvide appropriate consultation and technical assistance on the day-to-day IT support to business operations.\nProvide consultation and technical support on the sourcing and purchase of IT equipment in line with the Group / APAC catalogue. \nMaintain IT asset management and system to ensure that all assets are recorded and updated when required.\n\nRequirements\n\nBachelor’s degree in IT or related field preferred but not essential\nAt least 5 years’ experience in IT operations and projects with 2 year’s supervisor level experience.\nExperience managing local and global vendors. \nExperience in supporting systems related to but not limited to LMS, POS, ERP HRIS, CRM. \nPrevious experience working in F&B / Retail / Hospitality operations is highly desirable.\nMicrosoft O365 Modern Workplace Experience would be an asset \nKnowledge of Micros or Oracle Simphony would be a big advantage"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75937864",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "HIL Test Engineer",
    "jobCompany": "DXC Technology Enterprise Services (Hong Kong) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Eastern District",
    "jobSalary": "$30,000 – $40,000 per month",
    "jobSubClassification": "Testing & Quality Assurance",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "18h ago",
    "jobAdDetails": "Top 3-5 job requirements:\n\nExcellent Oral English skills\nMust have over 2 years' functional testing experience in vehicle\nMust have experience in HIL bench testing and be familiar with simulation  tool: CANoe\nDriving license in Hong Kong\nExcellent Problem solving skills, issue analysis skill\n\nBetter to have:\n\nExperience in using ODIS, VAS-Tester\n\n \n\nThe primary responsibilities for the role:\n\nFunctional testing for Grey service on HIL bench base on specific test cases.\nMultiple road tests a year for different SOPs , driving license  is required in Hong Kong.\nBench maintenance, including software/Firmware version upgrading, ECU configuration.\nProject planning and status reporting"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75956070",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Project Manager",
    "jobCompany": "Simbury Limited",
    "signed-out-save-job": "",
    "jobLocation": "Sha Tin District",
    "jobSubClassification": "Programme & Project Management",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "3h ago",
    "jobAdDetails": "Simbury is a fabless semiconductor company that strives to provide innovative solutions to make the world a better place. With its patented technologies, Simbury offers high data rates, ultra-low latency, and precise positioning/ranging - all with extremely low power consumption wireless connections technology for applications in spatial computing. The company combines advancements in product and technology, systems-level expertise with global partnerships to deliver the most fit solution to the client.\n\nTo cope with our expansion, we are looking for a Project Manager to drive and deliver the planning, coordination and implementation of Simbury's smart solutions. The successful candidate will be responsible for the following:\n\nJob Responsibilities:\n\nDrive project execution, ensuring the timely delivery of projects through planning, task scheduling, control and monitoring of project execution, budget control and risk management.\nEnsure project milestones and deliverables are completed on time and meet the required quality standards.\nReport progress to senior management and proactively identify and resolve any project related issues.\nCollaborate and maintain effective communication with internal stakeholders, R&D teams, clients, suppliers, government bodies and industry partners.\n\nRequirements:\n\nBachelor’s Degree or above in Electronics Engineering, Telecommunications, Business or relevant disciplines.\nMinimum 5 years of working experience in design/manufacturing industry with at least 3 years in IT&T, IoT or RF related experience.\nExperience in applying for government-funded scheme or projects would be an advantage.\nAbility to work cross-functionally across engineering and client management.\nExcellent command of written and spoken Cantonese, Putonghua and English.\nStrong interpersonal skills, highly motivated with a strong sense of responsibility.\nAble to work collaboratively and independently.\nProficiency in computer applications including MS-Office and AutoCAD.\nPassionate in implementing smart solutions systems, and understanding of user experience and requirements.\nHolder of Project Management Professional (PMP) or PRINCE is an advantage.\nOccasional travel to Mainland China is required.\n\nHow to Apply\n\nInterested parties please send your application with detailed resume including availability, current and expected salary.\n\nOnly short-listed candidates will be contacted.\n\nAll data provided will be kept in strict confidence and will be used for employment related purpose."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75961286",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Sales Manager - (Ref. G0WS)",
    "jobCompany": "Jebsen Beverage Company Limited",
    "signed-out-save-job": "",
    "jobLocation": "Wan Chai District",
    "jobSubClassification": "Sales - Pre & Post",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "58m ago",
    "jobAdDetails": "Purpose of the Job\n\nManage and develop the business with wholesaler.\n\n\nResponsibilities\n \n\nDevelop good rapport and networking with the wholesaler, work closely with wholesalers to grow the businesses and achieve business targets in Wholesale channel\nAs a relationship builder, be accountable for establishing and sustaining strong business relationships with our key existing / potential customers in Wholesale channel through regular visits to understand their needs\nPlay a key role in driving the market presence, distribution, product visibility and activation, demonstrate good understanding of Value Chain and margin levers\nIdentify and establish new business opportunities with the wholesaler to drive sales growth\nProvide regular market intelligence, analysis and update on the wholesaler segment strategies and tactics, develop and implement Selling-in and Selling-out strategies\nClosely monitoring the AR status of wholesaler and ensure AR arrangement meet the company requirement\n\nRequirements\n \n\nDegree holder or above in Business Administration\n4 - 6 years’ experience in wholesaler sales in FMCG industry, MNC experience is preferred\nWith wine knowledge would be an advantage\nSolid trade relationships and connections, strong in negotiation and account management skills\nGood command of both written and spoken English and Chinese (Cantonese and Mandarin)\nHands-on experience in Microsoft Excel, Word and PowerPoint\nPossess planning and strategic mindset\nPositive, well-organized, self-motivated and outgoing\n\nInterested parties please submit your application to our mailbox by clicking \"Apply Now\" below.\n\nFor more information about Jebsen Group, please visit www.jebsen.com or follow us on:\n\nSina Weibo      http://weibo.com/jebsengroup\n\nWeChat           ID: jebsen1895\n\nLinkedIn           Jebsen Group\n\nAll information provided by applicants will be used for recruitment purposes only.\n\nAt Jebsen, success breeds success."
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75217090",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "Client Enablement Operations Leader",
    "jobCompany": "Hongkong Wuzhou Information Technology Limited",
    "signed-out-save-job": "",
    "jobLocation": "Sha Tin District",
    "jobSalary": "$17,000 – $20,000 per month",
    "jobSubClassification": "Team Leaders",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "8h ago",
    "jobAdDetails": "关于我们\n\nHongkong Wuzhou Information Technology Limited are a professional third-party payment service enterprise engaged in international card acquiring and an international payment technology solution provider. By leveraging international card organizations such as VISA, MasterCard, JCB, AE, and domestic acquiring bank channels, we aim to establish connections and information exchange channels between banks and merchants, as well as between merchants and foreign consumers. Dedicated to helping domestic and foreign cross-border e-commerce enterprises solve international online collection/payment and foreign exchange settlement difficulties.\n\n \n\n \n\nQualifications & experience\n\n \n\nBachelor’s degree or above in Engineering, Business Administration, Information Sciences or equivalent\nManage client enablement team daily operation and ensure the team’s matrix and OKR is on track\nCo-work with commercial teams globally to ensure the smooth implementation/launch of new platform clients and to enable capabilities suiting client business and technical needs\nCollaborate closely with commercial, operations, and product teams: gather, evaluate, and summarize improvements opportunities and drive the overall Operations product and excellence/optimization\n\n \n\n \n\n \n\nTasks & responsibilities\n\n \n\nManage client enablement team daily operation and ensure the team’s matrix and OKR is on track\nCo-work with commercial teams globally to ensure the smooth implementation/launch of new platform clients and to enable capabilities suiting client business and technical needs\nCollaborate closely with commercial, operations, and product teams: gather, evaluate, and summarize improvements opportunities and drive the overall Operations product and excellence/optimization"
  },
  {
    "date": "2024-05-17",
    "salaryRange": "0-11000",
    "id": "75950130",
    "job-list-view-job-link": "",
    "job-list-item-link-overlay": "",
    "company-logo-container": "",
    "company-logo": "",
    "jobTitle": "IT Security Officer",
    "jobCompany": "Hong Leong Insurance (Asia) Limited",
    "signed-out-save-job": "",
    "jobLocation": "Eastern District",
    "jobSubClassification": "Security",
    "jobClassification": "(Information & Communication Technology)",
    "jobListingDate": "6h ago",
    "jobAdDetails": "Hong Leong Insurance (Asia) Limited (\"HLIA\") Co., Limited, is a registered insurance company in Hong Kong. It is an indirect wholly-owned subsidiary of Hong Leong Financial Group Berhad (“HLFG”), a public listed company in Malaysia, and a major associate of Guoco Group Limited in Hong Kong. HLIA has been active in Hong Kong since 1973. It has been assigned an A- (Excellent) financial strength rating from AM Best Company, one of the world’s leading rating agency specialized in insurance industry.\n\n \n\nResponsibilities \n\nProvide support on IT infrastructure and network security.\nPropose overall infrastructure design for application systems, including server infrastructure design, network design, security control design, disaster recovery design, service level standards, etc.\nAssist in writing IT security policies, procedure and security controls.\nMonitor operational procedures and processes for infrastructure & security.\nMaintain and implement measures in compliance with security standards e.g. PCI DSS, ISO27001.\nSupport infrastructure & network security related reviews, risk analysis and implementation.\nManage and work with vendors to resolve network and security incidents and problems.\n\n Requirements \n\nBachelor Degree in Information Technology or related disciplines.\nExperience in IT infrastructure, networking and security.\nCertified in either of CISA, CISSP, CISM, CRISC, CSX-F, CISP-HK.\nWorking experience in network equipment such as routers, switches, firewalls, proxies, network load balancers, intrusion detection/prevention systems.\nKnowledge of Windows, Active Directory, Linux, network security system, email security, endpoint protection, advance threat protection and latest cyber security landscape.\nFamiliar with security control administration, privileged account management.\n\nBenefits\n\nDental insurance, Double pay, 5-day work week, Medical insurance, Performance bonus\n\n \n\nPlease apply (preferably in Word or PDF format) with present and expected salaries, quoting job reference (JDBI/0301R/ITSO) to Chief Human Resources Officer, 50/F The Center, 99 Queen’s Road Central, Hong Kong or email to us or fax to 2285 3209. You are invited to visit our website at: http://www.hl-insurance.com.\n\nAll applications will be treated in strict confidence and used for recruitment purpose within Guoco Group Limited, or Hong Leong Group of which Guoco is a member (together, “the Group”) only. Personal data provided by job applicants to the Group will be used in accordance with “Guoco Group Policy on Personal Data for Job Applicants” (the “Policy”). A copy of the Policy is available upon request. By submitting the application to the Group, you agree that all personal data provided to the Group will be subject to the Policy.\n\nApplicants not hearing from us within 8 weeks may consider their applications unsuccessful. We may also consider their application for other or future vacancies within the Group. Personal data of unsuccessful applicants will be retained by the Group for a maximum period of one year."
  }
]